refactor: add more info, code & uml to readme
- Adiciona mais informações sobre o padrão
- Troca  mermaid por plantuml
- Adiciona importação aos códigos do projeto no lugar dos exemplos existentes
