--- a/README.md
+++ b/README.md
@@ -89,69 +88,67 @@ Use o padrão Abstract Factory quando:
 
 ## Outro exemplo
 
-```mermaid
----
-title: Fábrica de Marcas
----
-classDiagram
-    class Actor
+```plantuml
 
-    class IDeviceFactory {
-        +createPhones()
-        +createWatch()
-    }
+title Fábrica de Marcas
 
-    class AndroidFactory {
-        +createPhones() AndroidPhone
-        +createWatch() AndroidWatch
-    }
+class Actor
 
-    class AppleFactory {
-        +createPhones() IPhone
-        +createWatch() IWatch
-    }
+interface IDeviceFactory {
+    +createPhones()
+    +createWatch()
+}
 
-    class Phone {
-        +getDetails() string
-    }
+class AndroidFactory {
+    +createPhones(): AndroidPhone
+    +createWatch(): AndroidWatch
+}
 
-    class Watch {
-        +getDetails() string
-    }
+class AppleFactory {
+    +createPhones(): IPhone
+    +createWatch(): IWatch
+}
 
-    class AndroidPhone {
-        +getDetails() string
-    }
+class Phone {
+    +getDetails(): string
+}
 
-    class IPhone {
-        +getDetails() string
-    }
+class Watch {
+    +getDetails(): string
+}
 
-    class AndroidWatch {
-        +getDetails() string
-    }
+class AndroidPhone {
+    +getDetails(): string
+}
 
-    class IWatch {
-        +getDetails() string
-    }
+class IPhone {
+    +getDetails(): string
+}
 
-    %% Relações
-    Actor --> IDeviceFactory
+class AndroidWatch {
+    +getDetails(): string
+}
 
-    IDeviceFactory <|-- AndroidFactory
-    IDeviceFactory <|-- AppleFactory
+class IWatch {
+    +getDetails(): string
+}
 
-    AndroidFactory --> AndroidPhone
-    AndroidFactory --> AndroidWatch
+Actor --> IDeviceFactory
 
-    AppleFactory --> IPhone
-    AppleFactory --> IWatch
+IDeviceFactory <|-- AndroidFactory
+IDeviceFactory <|-- AppleFactory
 
-    AndroidPhone --|> Phone
-    IPhone --|> Phone
+AndroidFactory --> AndroidPhone
+AndroidFactory --> AndroidWatch
 
-    AndroidWatch --|> Watch
-    IWatch --|> Watch
+AppleFactory --> IPhone
+AppleFactory --> IWatch
+
+AndroidPhone --|> Phone
+IPhone --|> Phone
+
+AndroidWatch --|> Watch
+IWatch --|> Watch
 ```
 
 ## Participantes
